docs/mediciones/perf/50vu/k6-50vu-run4.txt
# Corrida 4 de 5 — perfil 50 VU sostenidos 30 s
# Fecha (UTC): 2026-09-03T22:49:00Z
# Commit: c2a3051
# Endpoint: GET /api/libros (autenticado con Bearer)
# k6: k6 v2.2.0 (commit/00a9a1b7f5, go1.26.5, linux/amd64)
#---

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /s/k6-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m25s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 55s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 02/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 02/50 VUs  00.4s/55.0s

running (0m02.0s), 05/50 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 05/50 VUs  01.4s/55.0s

running (0m03.0s), 08/50 VUs, 5 complete and 0 interrupted iterations
default   [   4% ] 08/50 VUs  02.4s/55.0s

running (0m04.0s), 12/50 VUs, 13 complete and 0 interrupted iterations
default   [   6% ] 12/50 VUs  03.4s/55.0s

running (0m05.0s), 15/50 VUs, 25 complete and 0 interrupted iterations
default   [   8% ] 15/50 VUs  04.4s/55.0s

running (0m06.0s), 18/50 VUs, 40 complete and 0 interrupted iterations
default   [  10% ] 18/50 VUs  05.4s/55.0s

running (0m07.0s), 21/50 VUs, 57 complete and 0 interrupted iterations
default   [  12% ] 21/50 VUs  06.4s/55.0s

running (0m08.0s), 25/50 VUs, 78 complete and 0 interrupted iterations
default   [  13% ] 25/50 VUs  07.4s/55.0s

running (0m09.0s), 28/50 VUs, 103 complete and 0 interrupted iterations
default   [  15% ] 28/50 VUs  08.4s/55.0s

running (0m10.0s), 31/50 VUs, 131 complete and 0 interrupted iterations
default   [  17% ] 31/50 VUs  09.4s/55.0s

running (0m11.0s), 34/50 VUs, 162 complete and 0 interrupted iterations
default   [  19% ] 34/50 VUs  10.4s/55.0s

running (0m12.0s), 38/50 VUs, 196 complete and 0 interrupted iterations
default   [  21% ] 38/50 VUs  11.4s/55.0s

running (0m13.0s), 41/50 VUs, 233 complete and 0 interrupted iterations
default   [  23% ] 41/50 VUs  12.4s/55.0s

running (0m14.0s), 44/50 VUs, 274 complete and 0 interrupted iterations
default   [  24% ] 44/50 VUs  13.4s/55.0s

running (0m15.0s), 47/50 VUs, 318 complete and 0 interrupted iterations
default   [  26% ] 47/50 VUs  14.4s/55.0s

running (0m16.0s), 50/50 VUs, 365 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  15.4s/55.0s

running (0m17.0s), 50/50 VUs, 415 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  16.4s/55.0s

running (0m18.0s), 50/50 VUs, 465 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  17.4s/55.0s

running (0m19.0s), 50/50 VUs, 515 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  18.4s/55.0s

running (0m20.0s), 50/50 VUs, 564 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  19.4s/55.0s

running (0m21.0s), 50/50 VUs, 614 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  20.4s/55.0s

running (0m22.0s), 50/50 VUs, 664 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  21.4s/55.0s

running (0m23.0s), 50/50 VUs, 714 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  22.4s/55.0s

running (0m24.0s), 50/50 VUs, 764 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  23.4s/55.0s

running (0m25.0s), 50/50 VUs, 813 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  24.4s/55.0s

running (0m26.0s), 50/50 VUs, 863 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  25.4s/55.0s

running (0m27.0s), 50/50 VUs, 912 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  26.4s/55.0s

running (0m28.0s), 50/50 VUs, 962 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  27.4s/55.0s

running (0m29.0s), 50/50 VUs, 1012 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  28.4s/55.0s

running (0m30.0s), 50/50 VUs, 1062 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  29.4s/55.0s

running (0m31.0s), 50/50 VUs, 1112 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  30.4s/55.0s

running (0m32.0s), 50/50 VUs, 1161 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  31.4s/55.0s

running (0m33.0s), 50/50 VUs, 1211 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  32.4s/55.0s

running (0m34.0s), 50/50 VUs, 1261 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  33.4s/55.0s

running (0m35.0s), 50/50 VUs, 1311 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  34.4s/55.0s

running (0m36.0s), 50/50 VUs, 1361 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  35.4s/55.0s

running (0m37.0s), 50/50 VUs, 1411 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  36.4s/55.0s

running (0m38.0s), 50/50 VUs, 1460 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  37.4s/55.0s

running (0m39.0s), 50/50 VUs, 1510 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  38.4s/55.0s

running (0m40.0s), 50/50 VUs, 1560 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  39.4s/55.0s

running (0m41.0s), 50/50 VUs, 1610 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  40.4s/55.0s

running (0m42.0s), 50/50 VUs, 1660 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  41.4s/55.0s

running (0m43.0s), 50/50 VUs, 1710 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  42.4s/55.0s

running (0m44.0s), 50/50 VUs, 1760 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  43.4s/55.0s

running (0m45.0s), 50/50 VUs, 1810 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  44.4s/55.0s

running (0m46.0s), 50/50 VUs, 1860 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  45.4s/55.0s

running (0m47.0s), 47/50 VUs, 1908 complete and 0 interrupted iterations
default   [  84% ] 47/50 VUs  46.4s/55.0s

running (0m48.0s), 42/50 VUs, 1955 complete and 0 interrupted iterations
default   [  86% ] 42/50 VUs  47.4s/55.0s

running (0m49.0s), 37/50 VUs, 1997 complete and 0 interrupted iterations
default   [  88% ] 37/50 VUs  48.4s/55.0s

running (0m50.0s), 31/50 VUs, 2034 complete and 0 interrupted iterations
default   [  90% ] 31/50 VUs  49.4s/55.0s

running (0m51.0s), 27/50 VUs, 2065 complete and 0 interrupted iterations
default   [  92% ] 27/50 VUs  50.4s/55.0s

running (0m52.0s), 21/50 VUs, 2092 complete and 0 interrupted iterations
default   [  93% ] 21/50 VUs  51.4s/55.0s

running (0m53.0s), 17/50 VUs, 2113 complete and 0 interrupted iterations
default   [  95% ] 17/50 VUs  52.4s/55.0s

running (0m54.0s), 11/50 VUs, 2130 complete and 0 interrupted iterations
default   [  97% ] 11/50 VUs  53.4s/55.0s

running (0m55.0s), 07/50 VUs, 2141 complete and 0 interrupted iterations
default   [  99% ] 07/50 VUs  54.4s/55.0s

running (0m56.0s), 02/50 VUs, 2148 complete and 0 interrupted iterations
default ↓ [ 100% ] 03/50 VUs  55s


  █ THRESHOLDS 

    catalogo_duracion
    ✓ 'p(95)<200' p(95)=7.58ms

    catalogo_errores
    ✓ 'rate<0.01' rate=0.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 4300    76.375012/s
    checks_succeeded...: 100.00% 4300 out of 4300
    checks_failed......: 0.00%   0 out of 4300

    ✓ catálogo responde 200
    ✓ catálogo devuelve contenido

    CUSTOM
    catalogo_duracion..............: avg=3.99ms min=171.83µs med=2.95ms max=410.79ms p(90)=5.9ms  p(95)=7.58ms
    catalogo_errores...............: 0.00%  0 out of 2150

    HTTP
    http_req_duration..............: avg=4.25ms min=171.83µs med=2.95ms max=561.28ms p(90)=5.91ms p(95)=7.59ms
      { expected_response:true }...: avg=4.25ms min=171.83µs med=2.95ms max=561.28ms p(90)=5.91ms p(95)=7.59ms
    http_req_failed................: 0.00%  0 out of 2151
    http_reqs......................: 2151   38.205267/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s       med=1s     max=1.41s    p(90)=1s     p(95)=1s    
    iterations.....................: 2150   38.187506/s
    vus............................: 2      min=2         max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 8.5 MB 151 kB/s
    data_sent......................: 1.0 MB 19 kB/s



running (0m56.3s), 00/50 VUs, 2150 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  55s